In [3]:
import pandas as pd
from sqlalchemy import create_engine

In [4]:
engine = create_engine('postgresql://postgres:kisan@localhost:5432/c5')

In [5]:
engine.connect()

In [4]:
data = pd.read_csv('yellow_tripdata_2016-02.csv', nrows=100000)

In [5]:
#Generic view of table

data.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2016-02-25 17:24:20,2016-02-25 17:27:20,2,0.70,-73.947250,40.763771,1,N,-73.992012,40.735390,2,5.0,0.0,0.5,0.0,0.0,0.3,5.8
1,2,2016-02-25 23:10:50,2016-02-25 23:31:50,2,5.52,-73.983017,40.750992,1,N,-73.988586,40.758839,2,20.0,0.5,0.5,0.0,0.0,0.3,21.3
2,2,2016-02-01 00:00:01,2016-02-01 00:10:52,6,1.99,-73.992340,40.758202,1,N,-73.964355,40.757977,1,9.5,0.5,0.5,0.7,0.0,0.3,11.5
3,1,2016-02-01 00:00:04,2016-02-01 00:05:16,1,1.50,-73.981453,40.749722,1,N,-73.982323,40.763985,2,6.5,0.5,0.5,0.0,0.0,0.3,7.8
4,2,2016-02-01 00:00:05,2016-02-01 00:20:59,1,5.60,-74.000603,40.729755,1,N,-73.951324,40.669834,1,20.0,0.5,0.5,4.0,0.0,0.3,25.3

In [12]:
#View of datatypes for each column

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 19 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               100000 non-null  int64
 1   tpep_pickup_datetime   100000 non-null  datetime64[ns]
 2   tpep_dropoff_datetime  100000 non-null  datetime64[ns]
 3   passenger_count        100000 non-null  int64
 4   trip_distance          100000 non-null  float64
 5   pickup_longitude       100000 non-null  float64
 6   pickup_latitude        100000 non-null  float64
 7   RatecodeID             100000 non-null  int64
 8   store_and_fwd_flag     100000 non-null  object
 9   dropoff_longitude      100000 non-null  float64
 10  dropoff_latitude       100000 non-null  float64
 11  payment_type           100000 non-null  int64
 12  fare_amount            100000 non-null  float64
 13  extra                  100000 non-null  float64
 14  mta_tax                100000 non-null  float64
 15  tip_amount             100000 non-null  float64
 16  tolls_amount           100000 non-null  float64
 17  improvement_surcharge  100000 non-null  float64
 18  total_amount           100000 non-null  float64
dtypes: datetime64[ns](2), float64(12), int64(4), object(1)
memory usage: 14.5+ MB

In [11]:
#Changed dtype of tpep_pickup_datetime and tpep_dropoff_datetime

data['tpep_pickup_datetime'] = pd.to_datetime(data['tpep_pickup_datetime'])
data['tpep_dropoff_datetime'] = pd.to_datetime(data['tpep_dropoff_datetime'])

In [13]:
data_headers = pd.read_csv('yellow_tripdata_2016-02.csv',nrows=0)
data_headers.to_sql(name='yellow_taxi_td',con=engine,if_exists='replace')

0

In [14]:
from time import time
import pandas as pd

def etl_nyc_taxi(chunk_size, table_name, connection):
    nyc_data = pd.read_csv('yellow_tripdata_2016-02.csv',chunksize=chunk_size)
    count = 1
    overall_start_time = time()
    
    for chunk in nyc_data:
        if count > 10:
            overall_end_time = time() - overall_start_time
            print(f'Finished loading a total of {chunk_size*(count-1):,} records in {overall_end_time/60:.3f} minutes')
            break;
        else:    
            t_start = time()
            chunk['tpep_pickup_datetime'] = pd.to_datetime(chunk['tpep_pickup_datetime'])
            chunk['tpep_dropoff_datetime'] = pd.to_datetime(chunk['tpep_dropoff_datetime'])
            chunk.to_sql(name=table_name,con=connection,if_exists='append', index=False)
            t_end = time()
            print(f'{count}) loaded data chunk in {t_end - t_start:.3f} seconds')
            count +=1

In [15]:
etl_nyc_taxi(100000,'yellow_taxi_td',engine)

1) loaded data chunk in 34.627 seconds
2) loaded data chunk in 32.314 seconds
3) loaded data chunk in 32.732 seconds
4) loaded data chunk in 36.957 seconds
5) loaded data chunk in 32.546 seconds
6) loaded data chunk in 31.840 seconds
7) loaded data chunk in 32.815 seconds
8) loaded data chunk in 32.497 seconds
9) loaded data chunk in 32.293 seconds
10) loaded data chunk in 32.463 seconds
Finished loading a total of 1,000,000 records in 5.630 minutes

In [17]:
#Testing if SQL queries are operational

data_overview = '''
SELECT * FROM yellow_taxi_td LIMIT 10

'''
pd.read_sql(data_overview,engine)

,index,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,None,2,2016-02-25 17:24:20,2016-02-25 17:27:20,2,0.7,-73.94725036621092,40.763771057128906,1,N,-73.99201202392578,40.735389709472656,2,5.0,0.0,0.5,0.0,0.0,0.3,5.8
1,None,2,2016-02-25 23:10:50,2016-02-25 23:31:50,2,5.52,-73.98301696777342,40.750991821289055,1,N,-73.98858642578125,40.758838653564446,2,20.0,0.5,0.5,0.0,0.0,0.3,21.3
2,None,2,2016-02-01 00:00:01,2016-02-01 00:10:52,6,1.99,-73.99234008789062,40.75820159912109,1,N,-73.96435546875,40.757976531982415,1,9.5,0.5,0.5,0.7,0.0,0.3,11.5
3,None,1,2016-02-01 00:00:04,2016-02-01 00:05:16,1,1.5,-73.98145294189453,40.74972152709961,1,N,-73.9823226928711,40.763984680175774,2,6.5,0.5,0.5,0.0,0.0,0.3,7.8
4,None,2,2016-02-01 00:00:05,2016-02-01 00:20:59,1,5.6,-74.00060272216798,40.72975540161133,1,N,-73.95132446289062,40.66983413696289,1,20.0,0.5,0.5,4.0,0.0,0.3,25.3
5,None,2,2016-02-01 00:00:06,2016-02-01 00:15:01,1,4.69,-74.0051040649414,40.7190055847168,1,N,-73.94709014892578,40.68888473510742,2,16.0,0.5,0.5,0.0,0.0,0.3,17.3
6,None,2,2016-02-01 00:00:09,2016-02-01 00:05:35,1,1.45,-73.98600006103516,40.76214599609375,1,N,-73.99060821533203,40.74620819091797,1,6.5,0.5,0.5,1.56,0.0,0.3,9.36
7,None,2,2016-02-01 00:00:19,2016-02-01 00:06:35,1,1.1,-73.96633148193358,40.77342224121094,1,N,-73.95610809326173,40.78142166137695,2,6.5,0.5,0.5,0.0,0.0,0.3,7.8
8,None,2,2016-02-01 00:00:21,2016-02-01 00:06:32,1,1.96,-73.97655487060547,40.76569747924805,1,N,-73.97897338867188,40.74438095092773,1,7.5,0.5,0.5,1.0,0.0,0.3,9.8
9,None,2,2016-02-01 00:00:21,2016-02-01 00:16:59,2,4.5,-73.97658538818358,40.764930725097656,1,N,-73.91111755371092,40.768909454345696,2,16.0,0.5,0.5,0.0,0.0,0.3,17.3

# Operations and performance

In [84]:
#Total trips recorded in dataset

total_recorded_trips = '''
SELECT COUNT(CAST(trip_distance AS NUMERIC)) AS total_trips
FROM yellow_taxi_td
WHERE trip_distance::numeric > 0
'''

pd.read_sql(total_recorded_trips, engine)

   total_trips
0       994264

In [85]:
#Average trip distance for all trips

avg_trip_distance = '''
SELECT AVG(CAST(trip_distance AS NUMERIC)) AS avg_distance
FROM yellow_taxi_td
'''

pd.read_sql(avg_trip_distance,engine)

   avg_distance
0      2.751403

In [86]:
#Which Vendor has the highest and lowest amount of trips

highest_lowest_trip_vendor = '''
SELECT 
    SUM(CASE WHEN "VendorID"::integer = 1 THEN 1 ELSE 0 END) AS vendor_one_count,
    SUM(CASE WHEN "VendorID"::integer = 2 THEN 1 ELSE 0 END) AS vendor_two_count
FROM yellow_taxi_td
'''
pd.read_sql(highest_lowest_trip_vendor, engine)

   vendor_one_count  vendor_two_count
0            468304            531696

In [87]:
#Average passenger count per trip

avg_pass_count = '''
SELECT ROUND(AVG(CAST(passenger_count AS NUMERIC)),0) AS avg_passenger_count
FROM yellow_taxi_td
WHERE trip_distance::numeric > 0
'''

pd.read_sql(avg_pass_count, engine)

   avg_passenger_count
0                  2.0

In [88]:
operation_and_performance = '''
SELECT CURRENT_DATE AS ingestion_date, * FROM

(SELECT COUNT(CAST(trip_distance AS NUMERIC)) AS total_trips
FROM yellow_taxi_td
WHERE trip_distance::numeric > 0) AS a,

(SELECT AVG(CAST(trip_distance AS NUMERIC)) AS avg_distance
FROM yellow_taxi_td) AS b,

(SELECT 
    SUM(CASE WHEN "VendorID"::integer = 1 THEN 1 ELSE 0 END) AS vendor_one_count,
    SUM(CASE WHEN "VendorID"::integer = 2 THEN 1 ELSE 0 END) AS vendor_two_count
FROM yellow_taxi_td) AS c,

(SELECT ROUND(AVG(CAST(passenger_count AS NUMERIC)),0) AS avg_passenger_count
FROM yellow_taxi_td
WHERE trip_distance::numeric > 0) AS d
'''

pd.read_sql(operation_and_performance,engine)

,ingestion_date,total_trips,avg_distance,vendor_one_count,vendor_two_count,avg_passenger_count
0,2023-08-24,994264,2.751403,468304,531696,2.0

# Customer Tendencies

In [92]:
#Average trip amount given by passengers

avg_trip_amount = '''
SELECT AVG(CAST(total_amount AS NUMERIC)) AS avg_trip_amount
FROM yellow_taxi_td
'''

pd.read_sql(avg_trip_amount,engine)

   avg_trip_amount
0        15.578133

In [93]:
#Average trip distance by passengers

avg_trip_distance = '''
SELECT ROUND(AVG(CAST(trip_distance AS NUMERIC)),1) AS avg_distance
FROM yellow_taxi_td
'''

pd.read_sql(avg_trip_distance,engine)

   avg_distance
0           2.8

In [94]:
#Trips flagged as store and forward

flagged_trips = '''
SELECT COUNT(store_and_fwd_flag) AS store_and_forward_trips
FROM yellow_taxi_td
WHERE store_and_fwd_flag = 'Y'
'''

pd.read_sql(flagged_trips,engine)

   store_and_forward_trips
0                     5918

In [95]:
#Trips with more than one passenger

shared_rides = '''
SELECT COUNT(passenger_count) AS shared_ride_count
FROM yellow_taxi_td
WHERE passenger_count::integer > 1 AND trip_distance::numeric > 0
'''

pd.read_sql(shared_rides,engine)

   shared_ride_count
0             266145

In [106]:
customer_tendencies = '''
SELECT CURRENT_DATE AS ingestion_date, * FROM

(SELECT AVG(CAST(total_amount AS NUMERIC)) AS avg_trip_amount
FROM yellow_taxi_td) AS a,

(SELECT ROUND(AVG(CAST(trip_distance AS NUMERIC)),1) AS avg_distance
FROM yellow_taxi_td) AS b,

(SELECT COUNT(store_and_fwd_flag) AS store_and_forward_trips
FROM yellow_taxi_td
WHERE store_and_fwd_flag = 'Y') AS c,

(SELECT COUNT(passenger_count) AS shared_ride_count
FROM yellow_taxi_td
WHERE passenger_count::integer > 1 AND trip_distance::numeric > 0) AS d

'''

pd.read_sql(customer_tendencies,engine)

,ingestion_date,avg_trip_amount,avg_distance,store_and_forward_trips,shared_ride_count
0,2023-08-24,15.578133,2.8,5918,266145

# Financial Performance

In [109]:
#Average fare amount per trip

avg_fare = '''SELECT ROUND(AVG(CAST(fare_amount AS NUMERIC)),2) AS average_fare
FROM yellow_taxi_td
'''

pd.read_sql(avg_fare,engine)

   average_fare
0         12.34

In [110]:
#Combined revenue generated from tolls and surcharges

comb_rev = '''
SELECT SUM(CAST(tolls_amount AS numeric) + CAST(improvement_surcharge AS numeric)) AS tolls_and_surcharge_revenue
FROM yellow_taxi_td
'''
pd.read_sql(comb_rev, engine)

   tolls_and_surcharge_revenue
0                     598262.8

In [111]:
#Average total amount paid by passengers

avg_t_amount = '''
SELECT ROUND(AVG(CAST(total_amount AS NUMERIC)),2) AS avg_total_p_amount
FROM yellow_taxi_td
'''

pd.read_sql(avg_t_amount, engine)

   avg_total_p_amount
0               15.58

In [121]:
financial_performance = '''
SELECT CURRENT_DATE AS ingestion_date, * FROM

(SELECT ROUND(AVG(CAST(fare_amount AS NUMERIC)),2) AS average_fare
FROM yellow_taxi_td) AS a,

(SELECT SUM(CAST(tolls_amount AS numeric) + CAST(improvement_surcharge AS numeric)) AS tolls_and_surcharge_revenue
FROM yellow_taxi_td) AS b,

(SELECT ROUND(AVG(CAST(total_amount AS NUMERIC)),2) AS avg_total_p_amount
FROM yellow_taxi_td) AS c
'''

pd.read_sql(financial_performance,engine)

,ingestion_date,average_fare,tolls_and_surcharge_revenue,avg_total_p_amount
0,2023-08-24,12.34,598262.8,15.58

# Creating reporting tables

In [105]:
operations_and_performance = pd.read_sql(operation_and_performance,engine)

In [108]:
customer_tendencies = pd.read_sql(customer_tendencies,engine)

In [125]:
financial_performance = pd.read_sql(financial_performance,engine)

In [126]:
def load_df_warehouse(df,table_name):
    df.to_sql(table_name,con=engine,if_exists='append', index=False)
    print(f'loaded {table_name} table successfully')

In [115]:
load_df_warehouse(operations_and_performance,'operations_and_performance')

loaded operations_and_performance table successfully

In [116]:
load_df_warehouse(customer_tendencies,'customer_tendencies')

loaded customer_tendencies table successfully

In [127]:
load_df_warehouse(financial_performance,'financial_performance')

loaded financial_performance table successfully